USE library;

INSERT INTO books(name, description, date_of_publication, category, isbn, number_of_pages, author_firt_name, author_last_name, author_email, author_age, author_dob, author_awards) VALUES
('Інститут', 'Тієї ночі почався кошмар. Батьків Люка вбили, а самого хлопця закинули в позашляховик та повезли в невідомому напрямку. Він приходить до тями в місці, яке називають Інститутом. Таке собі гетто для дещо…', '2019-10-09', 'Фантастика', '978-617-12-7678-9', 608, 'Стівен', 'Кінг', 'fdhtjncffgbf@gmail.com', 72, '1947-09-21', 'Премія О. Генрі'),
('Де живе свобода', 'Кохання, що спалахнуло між Віталією та Родіоном було приречене. Вчителька та учень – що тепер люди скажуть?', '2020-01-01', 'Сучасні автори', '978-617-12-7649-9', 208, 'Світлана', 'Талан', 'sghfrthfg@gmail.com', 60, '1960-03-07', 'Премія імені Пантелеймона Куліша'),
('Срібна затока', 'У цьому тихому австралійському містечку Ліза мріяла зцілити душу. Відпустити минуле, віднайти себе. Подалі від галасу та людей.', default, 'Роман', '978-617-12-7645-1', 432, 'Джоджо', 'Моєс', 'dgfhefdsb@gmail.com', 50, '1970-02-15', null),
('Дюна', 'Меланж, або прянощі, — найцінніша і найрідкісніша речовина у всесвіті, яка може все: від подовження життя до сприяння міжзоряним подорожам.', '1965-08-01', 'Фантастика', '978-617-12-7689-5', 656, 'Френк', 'Герберт', 'frdfhgfreg@gmail.com', 65, '1920-10-8', null),
('Хроніки Нарнії. Повна історія чарівного світу', 'Опис відсутній', default, 'Фантастика', '978-617-12-7122-7', 912, 'Клайв Стейплз', 'Льюїс', 'kldhgfdxq@gmail.com', 64, '1898-11-29', null),
('Львів. Шоколад. Кам’яниці', '«Львів. Шоколад. Кам’яниці» — збірка, яка привідкриє таємниці історії творення галицької столиці.', default, 'Сучасні автори', '978-617-12-7638-3', 256, 'Ніка', 'Нікалео', 'nigfdgfs@gmail.com', 47, '1973-02-16', null),
('Обіцянка собаки', 'Кажуть, усі собаки потрапляють до раю. Особливо такі, як Бейлі. Він прожив чимало життів і нарешті може спочити.', '2020-01-01', 'Сучасні автори', '978-617-12-7626-0', 384, 'Брюс', 'Кемерон', 'brsgfsd@gmail.com', 60, '1960-02-02', null),
('Я обіцяю тобі волю', 'Опис відсутній', '2020-01-01', 'Психологія', '978-617-12-7434-1', 384, 'Лоран', 'Гунел', 'lofdasa@gmail.com', 54, '1966-08-10', null),
('Останній сеанс', 'Опис відсутній', default, 'Детективи', '978-617-12-7636-9', 448, 'Аґата', 'Крісті', 'aghtytfd@gmail.com', 86, '1890-01-15', null),
('Кохання з першого погляду', 'Опис відсутній', '2020-01-01', 'Роман', '978-617-12-7616-1', 352, 'Ніна', 'Фіалко', 'nifgdfdseg@gmail.com', 76, '1943-09-10', null),
('Бог завжди подорожує інкогніто', 'Як не пропустити в житті ті можливості, які воно нам пропонує? Знайти своє призначення й зробити реальністю найзаповітніші та найсміливіші мрії? Шлях до самореалізації та самовдосконалення відкритий кожному, треба лише обрати вірний напрямок.', '2016-01-01', 'Психологія', '978-617-12-1552-8', 416, 'Лоран', 'Гунель', 'lofdgdaet@gmail.com', 53, '1966-08-10', null),
('Ніч у Лісабоні', 'Врятуватися, втекти з Європи якомога далі від нацистів! Їхня остання надія — пароплав до Америки.', '2019-01-01', 'Класика', '978-617-12-7129-6', 288, 'Еріх Марія', 'Ремарк', 'erfdbgfd@gmail.com', 72, '1898-07-22', null),
('Підсвідомості все підвладне', 'Підсвідомість — своєрідна Маріанська западина; це нетрі людської психіки. Підсвідомість керує нашими вчинками, коли ми цього навіть не усвідомлюємо.', '2019-01-01', 'Психологія', '978-617-12-6187-7', 176, 'Джон', 'Кехо', 'dgffrgdf@gmail.com', 86, '1934-01-01', null),
('Щиголь', 'Опис відсутній', '2016-01-01', 'Сучасні автори', '978-617-12-0838-4', 732, 'Донна', 'Тартт', 'dofghfdfd@gmail.com', 56, '1963-12-23', null),
('Подаруй мені зірку', 'Еліс просто хотіла бути щасливою. Гадала, що одруження подарує їй те, про що вона так мріяла. Але коли рідна Англія лишилася за океаном, Кентукі зустрів її задухою та консерватизмом.', default, 'Роман', '978-617-12-7096-1', 400, 'Джоджо', 'Мойєс', 'doaafdgf@gmail.com', 50, '1969-08-04', null),
('Психологія 101: Факти, теорія, статистика, тести й таке інше', 'Вивчаючи особистість, психологи звертають увагу на мислення, поведінку та емоції, які зумовлюють унікальність індивіда. Сукупність таких чинників називають «ментальною системою».', '2016-02-02', 'Психологія', '978-617-12-1465-1', 240, 'Пол', 'Клейнман', 'pogfdcdse@gmail.com', 40, '1980-05-03', null),
('Ігри, у які грають люди', 'Опис відсутній', '2020-01-01', 'Психологія', '978-617-12-0454-6', 256, 'Ерік', 'Берн', 'erafdgfd@gmail.com', 60, '1910-05-10', null),
('День, що навчив мене жити', 'Опис відсутній', '2019-01-01', 'Психологія', '978-617-12-5090-1', 288, 'Лоран', 'Гунель', 'lofdgdaet@gmail.com', 53, '1966-08-10', null),
('Учень убивці. Assassin 1', 'Опис відсутній', default, 'Фантастика', '978-617-12-5410-7', 416, 'Робін', 'Гобб', 'rodsgfh@gmail.com', 68, '1952-03-05', null),
('Характерник', 'У другій половині ХVІІ століття в Запорозькій Січі сталася неймовірна подія, яку зафіксовано в архівах тодішньої Московії і яку не оминув увагою жоден доскіпливий хроніст козаччини.', '2019-01-01', 'Сучасні автори', '978-617-12-6841-8', 304, 'Василь', 'Шкляр', 'vadytiuk@gmail.com', 68, '1951-07-10', null),
('48 законів влади', 'Опис відсутній', '2017-01-01', 'Психологія', '978-617-12-3366-9', 608, 'Роберт', 'Грін', 'robehfgd@gmail.com', 61, '1959-05-14', null),
('Квіти для Елджернона', 'Опис відсутній', '2019-01-01', 'Сучасні автори', '978-617-12-7611-6', 304, 'Деніел', 'Кіз', 'danfdgsd@gmail.com', 87, '1927-08-09', null),
('П’ять четвертинок апельсина', 'Опис відсутній', default, 'Сучасні автори', '978-617-12-6844-9', 352, 'Джоан', 'Гаррис', 'dfgggff@gmail.com', 55, '1964-07-03', null),
('Грішна', 'Опис відсутній', '2019-01-10', 'Трилери', '978-617-12-6847-0', 336, 'Тесс', 'Геррітсен', 'tfdrdhgfvewr4@gmail.com', 66, '1953-06-12', null),
('Чужі гріхи', 'Опис відсутній', '2020-01-10', 'Роман', '978-617-12-7456-3', 240, 'Тетяна', 'П’янкова', 'tesgfdgf@gmail.com', 34, '1985-07-03', null);

SELECT * FROM books; # витягнути всі книжки
UPDATE books SET author_last_name = 'new last name' WHERE id in(1, 2); # обновити прізвище автора в 2х книжках
SELECT count(author_awards) FROM books; # підрахувати кількість книжок, в яких автори мають нагороди
SELECT * FROM books WHERE number_of_pages = (SELECT min(number_of_pages) FROM books); # вивести інформацію про книжку з найменшою кількістю сторінок
SELECT max(number_of_pages) FROM books; # вивести максимальну кількість сторінок

ALTER TABLE books ADD price DECIMAL(8,2);
SET SQL_SAFE_UPDATES = 0;
UPDATE books SET price = floor(50 + (rand() * 1000));

SELECT avg(price) FROM books; # вивести середню ціну між всіма книжками
SELECT sum(price) FROM books WHERE category = 'Психологія'; # порахувати суму книжок за категорією
SELECT min(price) FROM books; # вивести мінімальну ціну книжки
SELECT * FROM books WHERE price = (SELECT min(price) FROM books); # вивести інформацію про книжку з найменшою ціною
SELECT name, round(price, 4) FROM books ORDER BY name; # вивести книжки, де ціна матиме 4 знаки після коми, відсортовано за назвою книги

# вивести книжки за limit (5, 5), (10, 6) та відсортувати за датою публікації.
SELECT * FROM books ORDER BY date_of_publication LIMIT 5,5; 
SELECT * FROM books ORDER BY date_of_publication LIMIT 10,6;

# написати 3 запити, використавши різні види пошуку за співпадіннями(like)
SELECT * FROM books WHERE date_of_publication LIKE '2018%';
SELECT * FROM books WHERE number_of_pages LIKE '_00';
SELECT * FROM books WHERE  description LIKE '%століття%';

# вивести книжки де ціна на проміжку: 1. 50-120, 2. не включаючи проміжок 200-600
SELECT * FROM books WHERE price BETWEEN 50 AND 120;
SELECT * FROM books WHERE price  NOT BETWEEN 200 AND 600;

# 3 запити на видалення книжки(за id, name, isbn)
DELETE FROM books WHERE id = 1;
DELETE FROM books WHERE name = 'Коли впаде темрява';
DELETE FROM books WHERE isbn = '978-617-12-1037-0';