CREATE DATABASE library;
USE library;

CREATE TABLE books(
name VARCHAR(120) NOT NULL,
description TEXT,
date_of_publication DATE NOT NULL DEFAULT '2018-01-01',
author VARCHAR(60) NOT NULL,
category VARCHAR(30) NOT NULL);


INSERT INTO books VALUES
("Пісня льоду й полум'я. Книга 1. Гра престолів", 'Опис відсутній', '2019-05-08', 'Джордж Мартін', 'Фантастика'),
("Пісня льоду й полум'я. Книга 2. Битва королів", 'Опис відсутній', '2019-04-20', 'Джордж Мартін', 'Фантастика'),
("Пісня льоду й полум'я. Книга 3. Буря мечів", 'Опис відсутній', '2019-04-15', 'Джордж Мартін', 'Фантастика'),
("Пісня льоду й полум'я. Книга 4. Бенкет круків", 'Опис відсутній', '2019-02-02', 'Джордж Мартін', 'Фантастика'),
("Пісня льоду й полум'я. Книга 5. Танок драконів", 'Опис відсутній', '2019-01-15', 'Джордж Мартін', 'Фантастика'),
('Коли впаде темрява', 'Опис відсутній', '2009-02-11', 'Стівен Кінг', 'Фантастика'),
('Багатий тато, Бідний тато', 'Опис відсутній', '1997-01-05', 'Роберт Кійосакі', 'Мотивація. Самовдосконалення'),
('Вбивство у "Східному експресі"', 'Опис відсутній', '2017-01-05', 'Агата Крісті', 'Детектив'),
('Психологія впливу', 'Опис відсутній', '1984-01-05', 'Роберт Чалдіні', 'Психологія'),
('Людина розумна. Історія людства від минулого до майбутнього', 'Опис відсутній', '2016-01-05', 'Ювал Ной Харарі', 'Навчальна література');