CREATE DATABASE library;
USE library;

CREATE TABLE books(
name VARCHAR(120) NOT NULL,
description TEXT,
date_of_publication DATE NOT NULL DEFAULT '2018-01-01',
category VARCHAR(30) NOT NULL,
isbn VARCHAR(20) NOT NULL UNIQUE,
number_of_pages SMALLINT NOT NULL,
author_firt_name VARCHAR(45) NOT NULL,
author_last_name VARCHAR(45) NOT NULL,
author_email VARCHAR(50) NOT NULL,
author_age TINYINT NOT NULL,
author_dob DATE NOT NULL,
author_awards VARCHAR(120)
);


INSERT INTO books VALUES
("Пісня льоду й полум'я. Книга 1. Гра престолів", 'Опис відсутній', '2019-05-08', 'Фантастика', '978-966-948-271-6', 800, 'Джордж', 'Мартін', 'sdgfdgregf@gmail.com', 71, '1948-09-20', 'Всесвітня премія фентезі за найкращу повість'),
("Пісня льоду й полум'я. Книга 2. Битва королів", 'Опис відсутній', '2019-04-20', 'Фантастика', '978-617-538-325-4', 864, 'Джордж', 'Мартін', 'sdgfdgregf@gmail.com', 71, '1948-09-20', 'Всесвітня премія фентезі за найкращу повість'),
("Пісня льоду й полум'я. Книга 3. Буря мечів", 'Опис відсутній', '2019-04-15', 'Фантастика', '978-617-538-399-5', 1152, 'Джордж', 'Мартін', 'sdgfdgregf@gmail.com', 71, '1948-09-20', 'Всесвітня премія фентезі за найкращу повість'),
("Пісня льоду й полум'я. Книга 4. Бенкет круків", 'Опис відсутній', '2019-02-02', 'Фантастика', '978-617-7409-11-2', 832, 'Джордж', 'Мартін', 'sdgfdgregf@gmail.com', 71, '1948-09-20', 'Всесвітня премія фентезі за найкращу повість'),
("Пісня льоду й полум'я. Книга 5. Танок драконів", 'Опис відсутній', '2019-01-15', 'Фантастика', '978-617-7535-75-0', 1152, 'Джордж', 'Мартін', 'sdgfdgregf@gmail.com', 71, '1948-09-20', 'Всесвітня премія фентезі за найкращу повість'),
('Відьмак. Останнє бажання. Книга 1', 'Опис відсутній', '2019-01-02', 'Фантастика', '978-617-12-0499-7', 288, 'Анджей', 'Сапковський', 'ghfdtnbvjgg@gmail.com', 71, '1948-06-21', 'Всесвітня премія фентезі за життєві досягнення'),
('Відьмак. Меч призначення. Книга 2', 'Опис відсутній', '2018-10-02', 'Фантастика', '978-617-12-0498-0', 368, 'Анджей', 'Сапковський', 'ghfdtnbvjgg@gmail.com', 71, '1948-06-21', 'Всесвітня премія фентезі за життєві досягнення'),
('Відьмак. Кров ельфів. Книга 3', 'Опис відсутній', '2018-10-02', 'Фантастика', '978-617-12-1037-0', 320, 'Анджей', 'Сапковський', 'ghfdtnbvjgg@gmail.com', 71, '1948-06-21', 'Всесвітня премія фентезі за життєві досягнення'),
('Відьмак. Час Погорди. Книга 4', 'Опис відсутній', '2018-05-02', 'Фантастика', '978-617-12-1038-7', 292, 'Анджей', 'Сапковський', 'ghfdtnbvjgg@gmail.com', 71, '1948-06-21', 'Всесвітня премія фентезі за життєві досягнення'),
('Відьмак. Хрещення вогнем. Книга 5', 'Опис відсутній', '2018-03-14', 'Фантастика', '978-617-12-1488-0', 384, 'Анджей', 'Сапковський', 'ghfdtnbvjgg@gmail.com', 71, '1948-06-21', 'Всесвітня премія фентезі за життєві досягнення'),
('Відьмак. Вежа Ластівки. Книга 6', 'Опис відсутній', '2018-02-11', 'Фантастика', '978-617-12-1656-3', 480, 'Анджей', 'Сапковський', 'ghfdtnbvjgg@gmail.com', 71, '1948-06-21', 'Всесвітня премія фентезі за життєві досягнення'),
('Відьмак. Володарка Озера. Книга 7', 'Опис відсутній', '2018-01-10', 'Фантастика', '978-617-12-3114-6', 576, 'Анджей', 'Сапковський', 'ghfdtnbvjgg@gmail.com', 71, '1948-06-21', 'Всесвітня премія фентезі за життєві досягнення'),
('Відьмак. Сезон гроз. Книга 8', 'Опис відсутній', '2017-03-10', 'Фантастика', '978-617-12-3396-6', 352, 'Анджей', 'Сапковський', 'ghfdtnbvjgg@gmail.com', 71, '1948-06-21', 'Всесвітня премія фентезі за життєві досягнення'),
('Коли впаде темрява', 'Опис відсутній', '2017-02-11', 'Фантастика', '978-617-12-7655-0', 432, 'Стівен', 'Кінг', 'fdhtjncffgbf@gmail.com', 72, '1947-09-21', 'Премія О. Генрі');
