CREATE DATABASE library;
USE library;

CREATE TABLE books(
id INT NOT NULL PRIMARY KEY AUTO_INCREMENT,
name VARCHAR(120) NOT NULL,
description TEXT,
date_of_publication DATE NOT NULL DEFAULT '2018-01-01',
category VARCHAR(30) NOT NULL,
isbn VARCHAR(20) NOT NULL UNIQUE,
number_of_pages SMALLINT NOT NULL,
author_firt_name VARCHAR(45) NOT NULL,
author_last_name VARCHAR(45) NOT NULL,
author_email VARCHAR(50) NOT NULL,
author_age TINYINT NOT NULL,
author_dob DATE NOT NULL,
author_awards VARCHAR(120)
);


INSERT INTO books(name, description, date_of_publication, category, isbn, number_of_pages, author_firt_name, author_last_name, author_email, author_age, author_dob, author_awards) VALUES
("Пісня льоду й полум'я. Книга 1. Гра престолів", 'Опис відсутній', '1996-05-08', 'Фантастика', '978-966-948-271-6', 800, 'Джордж', 'Мартін', 'sdgfdgregf@gmail.com', 71, '1948-09-20', 'Всесвітня премія фентезі за найкращу повість'),
("Пісня льоду й полум'я. Книга 2. Битва королів", 'Опис відсутній', '1998-04-20', 'Фантастика', '978-617-538-325-4', 864, 'Джордж', 'Мартін', 'sdgfdgregf@gmail.com', 71, '1948-09-20', 'Всесвітня премія фентезі за найкращу повість'),
("Пісня льоду й полум'я. Книга 3. Буря мечів", 'Опис відсутній', '2000-04-15', 'Фантастика', '978-617-538-399-5', 1152, 'Джордж', 'Мартін', 'sdgfdgregf@gmail.com', 71, '1948-09-20', 'Всесвітня премія фентезі за найкращу повість'),
("Пісня льоду й полум'я. Книга 4. Бенкет круків", 'Опис відсутній', '2005-02-02', 'Фантастика', '978-617-7409-11-2', 832, 'Джордж', 'Мартін', 'sdgfdgregf@gmail.com', 71, '1948-09-20', 'Всесвітня премія фентезі за найкращу повість'),
("Пісня льоду й полум'я. Книга 5. Танок драконів", 'Опис відсутній', '2011-01-15', 'Фантастика', '978-617-7535-75-0', 1152, 'Джордж', 'Мартін', 'sdgfdgregf@gmail.com', 71, '1948-09-20', 'Всесвітня премія фентезі за найкращу повість'),
('Відьмак. Останнє бажання. Книга 1', 'Опис відсутній', '1986-01-02', 'Фантастика', '978-617-12-0499-7', 288, 'Анджей', 'Сапковський', 'ghfdtnbvjgg@gmail.com', 71, '1948-06-21', 'Всесвітня премія фентезі за життєві досягнення'),
('Відьмак. Меч призначення. Книга 2', 'Опис відсутній', '1989-10-02', 'Фантастика', '978-617-12-0498-0', 368, 'Анджей', 'Сапковський', 'ghfdtnbvjgg@gmail.com', 71, '1948-06-21', 'Всесвітня премія фентезі за життєві досягнення'),
('Відьмак. Кров ельфів. Книга 3', 'Опис відсутній', '1992-10-02', 'Фантастика', '978-617-12-1037-0', 320, 'Анджей', 'Сапковський', 'ghfdtnbvjgg@gmail.com', 71, '1948-06-21', 'Всесвітня премія фентезі за життєві досягнення'),
('Відьмак. Час Погорди. Книга 4', 'Опис відсутній', '1998-05-02', 'Фантастика', '978-617-12-1038-7', 292, 'Анджей', 'Сапковський', 'ghfdtnbvjgg@gmail.com', 71, '1948-06-21', 'Всесвітня премія фентезі за життєві досягнення'),
('Відьмак. Хрещення вогнем. Книга 5', 'Опис відсутній', '2001-03-14', 'Фантастика', '978-617-12-1488-0', 384, 'Анджей', 'Сапковський', 'ghfdtnbvjgg@gmail.com', 71, '1948-06-21', 'Всесвітня премія фентезі за життєві досягнення'),
('Відьмак. Вежа Ластівки. Книга 6', 'Опис відсутній', '2005-02-11', 'Фантастика', '978-617-12-1656-3', 480, 'Анджей', 'Сапковський', 'ghfdtnbvjgg@gmail.com', 71, '1948-06-21', 'Всесвітня премія фентезі за життєві досягнення'),
('Відьмак. Володарка Озера. Книга 7', 'Опис відсутній', '2008-01-10', 'Фантастика', '978-617-12-3114-6', 576, 'Анджей', 'Сапковський', 'ghfdtnbvjgg@gmail.com', 71, '1948-06-21', 'Всесвітня премія фентезі за життєві досягнення'),
('Відьмак. Сезон гроз. Книга 8', 'Опис відсутній', '2011-03-10', 'Фантастика', '978-617-12-3396-6', 352, 'Анджей', 'Сапковський', 'ghfdtnbvjgg@gmail.com', 71, '1948-06-21', 'Всесвітня премія фентезі за життєві досягнення'),
('Коли впаде темрява', 'Опис відсутній', '2009-02-11', 'Фантастика', '978-617-12-7655-0', 432, 'Стівен', 'Кінг', 'fdhtjncffgbf@gmail.com', 72, '1947-09-21', 'Премія О. Генрі'),
('Багатий тато, Бідний тато', 'Опис відсутній', '1997-01-05', 'Мотивація. Самовдосконалення', '978-966-426-071-5', 256, 'Роберт', 'Кійосакі', 'kgfdgrfdsv54@gmail.com', 73, '1947-04-07', null),
('Вбивство у "Східному експресі"', 'Опис відсутній', '2017-01-05', 'Детектив', '978-617-12-3880-0', 288, 'Агата', 'Крісті', 'afdgfgdrefd4tfg@gmail.com', 86, '1890-15-09', null),
('Психологія впливу', 'Опис відсутній', '1984-01-05', 'Психологія', '978-617-12-3352-2', 352, 'Роберт', 'Чалдіні', 'rhvgfdbcedr@gmail.com', 75, '1945-04-27', null),
('Людина розумна. Історія людства від минулого до майбутнього', 'Опис відсутній', '2016-01-05', 'Навчальна література', '978-617-12-1531-3', 544, 'Ювал Ной', 'Харарі', 'yftgfdczxvbv@gmail.com', 44, '1976-04-27', null),
('Про Всесвіт коротко', 'Опис відсутній', '2001-01-12', 'Навчальна література', '978-617-12-7641-3', 192, 'Стівен', 'Гокінг', 'sfgfdhgtrtgf@gmail.com', 76, '1942-01-08', 'Премія ім. А. Ейнштейна'),
('Найкоротша історія часу', 'Опис відсутній', '2016-01-11', 'Навчальна література', '978-617-12-1054-7', 160, 'Стівен', 'Гокінг', 'sfgfdhgtrtgf@gmail.com', 76, '1942-01-08', 'Премія ім. А. Ейнштейна'),
('Сяйво', 'Опис відсутній', '1977-01-10', 'Жахи', '978-617-12-7081-7', 640, 'Стівен', 'Кінг', 'fdhtjncffgbf@gmail.com', 72, '1947-09-21', 'Премія О. Генрі'),
('Доктор Сон', 'Опис відсутній', '2011-06-05', 'Жахи', '978-617-12-6831-9', 531, 'Стівен', 'Кінг', 'fdhtjncffgbf@gmail.com', 72, '1947-09-21', 'Премія О. Генрі'),
('Крістіна', 'Опис відсутній', '1983-02-10', 'Жахи', '978-617-12-2479-7', 576, 'Стівен', 'Кінг', 'fdhtjncffgbf@gmail.com', 72, '1947-09-21', 'Премія О. Генрі'),
('Воно', 'Опис відсутній', '1986-02-10', 'Жахи', '978-617-12-6699-5', 1344, 'Стівен', 'Кінг', 'fdhtjncffgbf@gmail.com', 72, '1947-09-21', 'Премія О. Генрі'),
('Двійник', 'Опис відсутній', '2020-01-10', 'Жахи', '978-617-12-4948-6', 384, 'Тесс', 'Геррітсен', 'tfdrdhgfvewr4@gmail.com', 66, '1953-06-12', null);

SELECT * FROM books;
SELECT * FROM books WHERE id = 5 OR id = 10 OR id = 13;
SELECT * FROM books WHERE number_of_pages > 150;
SELECT * FROM books WHERE author_age > 30;
SELECT * FROM books WHERE author_age > 30;
SELECT * FROM books WHERE author_awards IS NULL;
SELECT * FROM books WHERE author_email = 'sdgfdgregf@gmail.com';
SELECT * FROM books WHERE isbn = '978-966-948-271-6';
SELECT * FROM books WHERE category = 'Жахи';
SELECT * FROM books WHERE number_of_pages > 200 AND author_age > 25;
SELECT * FROM books WHERE category = 'Навчальна література' OR category = 'Жахи';
SELECT * FROM books ORDER BY name;
SELECT * FROM books ORDER BY author_email;
SELECT * FROM books ORDER BY number_of_pages DESC;
SELECT DISTINCT category FROM books;
SELECT DISTINCT author_firt_name FROM books;
SELECT * FROM books WHERE date_of_publication > '2000-01-01';
SELECT * FROM books WHERE date_of_publication < '2010-01-01';
